In [1]:
import pandas as pd

In [2]:
df_1=pd.read_csv('C:/Users/jangd/OneDrive/사진/문서/GitHub/git_hub_0420/python/project/dataset/kospi.csv')
df_1.drop(['등락율'],axis=1,inplace=True)
df_1

            Date       종가
0     2002-01-02   724.95
1     2002-01-03   727.66
2     2002-01-04   747.72
3     2002-01-07   751.48
4     2002-01-08   734.76
...          ...      ...
5017  2022-04-19  2718.89
5018  2022-04-20  2718.69
5019  2022-04-21  2728.21
5020  2022-04-22  2704.71
5021  2022-04-25  2657.13

[5022 rows x 2 columns]

In [3]:
df_1['date'] = pd.to_datetime(df_1['Date'])
df_1['date']
df_1['Date']=df_1['date']
df_1 # 데이트타임 타입으로 바꾸기

           Date       종가       date
0    2002-01-02   724.95 2002-01-02
1    2002-01-03   727.66 2002-01-03
2    2002-01-04   747.72 2002-01-04
3    2002-01-07   751.48 2002-01-07
4    2002-01-08   734.76 2002-01-08
...         ...      ...        ...
5017 2022-04-19  2718.89 2022-04-19
5018 2022-04-20  2718.69 2022-04-20
5019 2022-04-21  2728.21 2022-04-21
5020 2022-04-22  2704.71 2022-04-22
5021 2022-04-25  2657.13 2022-04-25

[5022 rows x 3 columns]

In [4]:
# diff를 통해 차분시행 후, 데이터 Nan 값 제거

kospi_diff = df_1.diff(1)['종가'].dropna()
kospi_diff = pd.DataFrame(kospi_diff)
print('diff 후 \n', kospi_diff.head())

print('-'*10)
# shift를 통해 1/4일 데이터를 1/5일로 미룸

kospi_shift = df_1['종가'].shift(1).dropna()
kospi_shift = pd.DataFrame(kospi_shift)
print('shift 후 \n', kospi_shift.head())

diff 후
       종가
1   2.71
2  20.06
3   3.76
4 -16.72
5  16.85
----------
shift 후
        종가
1  724.95
2  727.66
3  747.72
4  751.48
5  734.76

In [5]:
df_1['등락률']= (kospi_diff / kospi_shift) * 100
df_1.sort_index(ascending=False)
# df_1['Day_Name'] = df_1['Date'].dt.day_name()
df_1.drop('date',axis=1,inplace=True)
df_1

           Date       종가       등락률
0    2002-01-02   724.95       NaN
1    2002-01-03   727.66  0.373819
2    2002-01-04   747.72  2.756782
3    2002-01-07   751.48  0.502862
4    2002-01-08   734.76 -2.224943
...         ...      ...       ...
5017 2022-04-19  2718.89  0.953509
5018 2022-04-20  2718.69 -0.007356
5019 2022-04-21  2728.21  0.350169
5020 2022-04-22  2704.71 -0.861371
5021 2022-04-25  2657.13 -1.759153

[5022 rows x 3 columns]

In [6]:
df_1['date'] = pd.to_datetime(df_1['Date'])
df_1['date']
df_1['Date']=df_1['date']
df_1

           Date       종가       등락률       date
0    2002-01-02   724.95       NaN 2002-01-02
1    2002-01-03   727.66  0.373819 2002-01-03
2    2002-01-04   747.72  2.756782 2002-01-04
3    2002-01-07   751.48  0.502862 2002-01-07
4    2002-01-08   734.76 -2.224943 2002-01-08
...         ...      ...       ...        ...
5017 2022-04-19  2718.89  0.953509 2022-04-19
5018 2022-04-20  2718.69 -0.007356 2022-04-20
5019 2022-04-21  2728.21  0.350169 2022-04-21
5020 2022-04-22  2704.71 -0.861371 2022-04-22
5021 2022-04-25  2657.13 -1.759153 2022-04-25

[5022 rows x 4 columns]

In [7]:
df_1.drop('date',axis=1,inplace=True)
df_1

           Date       종가       등락률
0    2002-01-02   724.95       NaN
1    2002-01-03   727.66  0.373819
2    2002-01-04   747.72  2.756782
3    2002-01-07   751.48  0.502862
4    2002-01-08   734.76 -2.224943
...         ...      ...       ...
5017 2022-04-19  2718.89  0.953509
5018 2022-04-20  2718.69 -0.007356
5019 2022-04-21  2728.21  0.350169
5020 2022-04-22  2704.71 -0.861371
5021 2022-04-25  2657.13 -1.759153

[5022 rows x 3 columns]

In [8]:
df_1['Day_Name'] = df_1['Date'].dt.day_name()
month_end = pd.date_range('2005-01-03','2022-04-03', freq='M')
#Get only end of month prices (월말 가격 데이터 생성)
df_month = df_1[df_1['Date'].isin(month_end)].reset_index(drop=True)
df_month.sort_index(ascending=False)

          Date       종가       등락률  Day_Name
132 2022-03-31  2757.65  0.397198  Thursday
131 2022-02-28  2699.18  0.837580    Monday
130 2021-11-30  2839.01 -2.416716   Tuesday
129 2021-09-30  3068.82  0.279387  Thursday
128 2021-08-31  3199.27  1.751803   Tuesday
..         ...      ...       ...       ...
4   2005-06-30  1008.16  0.908836  Thursday
3   2005-05-31   970.21  0.120738   Tuesday
2   2005-03-31   965.68  1.070700  Thursday
1   2005-02-28  1011.36  1.445408    Monday
0   2005-01-31   932.70  1.205525    Monday

[133 rows x 4 columns]

In [9]:
df_month = df_month.set_index(['Date']).drop(['Day_Name'],axis=1)
 
df_month

                 종가       등락률
Date
2005-01-31   932.70  1.205525
2005-02-28  1011.36  1.445408
2005-03-31   965.68  1.070700
2005-05-31   970.21  0.120738
2005-06-30  1008.16  0.908836
...             ...       ...
2021-08-31  3199.27  1.751803
2021-09-30  3068.82  0.279387
2021-11-30  2839.01 -2.416716
2022-02-28  2699.18  0.837580
2022-03-31  2757.65  0.397198

[133 rows x 2 columns]

In [10]:
# diff를 통해 차분시행 후, 데이터 Nan 값 제거

kospi_diff = df_month.diff(1)['종가'].dropna()
kospi_diff = pd.DataFrame(kospi_diff)
print('diff 후 \n', kospi_diff.head())

print('-'*10)
# shift를 통해 1/4일 데이터를 1/5일로 미룸

kospi_shift = df_month['종가'].shift(1).dropna()
kospi_shift = pd.DataFrame(kospi_shift)
print('shift 후 \n', kospi_shift.head())

diff 후
                종가
Date
2005-02-28  78.66
2005-03-31 -45.68
2005-05-31   4.53
2005-06-30  37.95
2005-08-31  75.17
----------
shift 후
                  종가
Date
2005-02-28   932.70
2005-03-31  1011.36
2005-05-31   965.68
2005-06-30   970.21
2005-08-31  1008.16

In [11]:
df_month['등락률']= (kospi_diff / kospi_shift) * 100
df_month.sort_index(ascending=False)
# df_1['Day_Name'] = df_1['Date'].dt.day_name()

                 종가       등락률
Date
2022-03-31  2757.65  2.166213
2022-02-28  2699.18 -4.925308
2021-11-30  2839.01 -7.488546
2021-09-30  3068.82 -4.077493
2021-08-31  3199.27 -2.954791
...             ...       ...
2005-06-30  1008.16  3.911524
2005-05-31   970.21  0.469099
2005-03-31   965.68 -4.516690
2005-02-28  1011.36  8.433580
2005-01-31   932.70       NaN

[133 rows x 2 columns]